Revit 2027 API
BuiltInFailures.FamilyFailures.InsertOrientationChangedToBeValid Property
 The insert orientation was modified to be compatible with the wall's cross-section.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InsertOrientationChangedToBeValid { get; }
Public Shared ReadOnly Property InsertOrientationChangedToBeValid As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InsertOrientationChangedToBeValid {
	FailureDefinitionId^ get ();
}
static member InsertOrientationChangedToBeValid : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace